# дан список чисел.
# определить,определите сколько в нем встречается различных чисел



myList = [1,1,2,0,-1,3,4,4]
print(len(set(myList)))
print(set(myList))